export interface CaseResult {
    label: string
    value: string
}

export interface CaseItem {
    id: string
    index: number // номер секции в общем списке
    title: string
    company: string
    period?: string
    problem: string
    solution: string
    results: CaseResult[]
    tags?: string[]
    hideRightSlot?: boolean
}

export const DEFAULT_CASES: CaseItem[] = [
    {
        id: 'case-1',
        index: 12,
        title: 'Сделал лучше чем кто либо предпологал',
        company: 'Яндекс',
        period: '05.2024 - 06.2024',
        problem:
            'Была задач добавить небольшую анцимацию на главную страницу и никаких макетов. ',
        solution:
            'Я сильно улучшил анимацию, добавил интерактив и оптимизировал при помощи линивой загрузки анмации и оптимизации самой анимации. ' +
            'Анимация идеально работала даже на самых старых телефонах, а также мной было придумано за интерактив в этой анимации получать символический приз. ' +
            'Не смотря на то что продукт не был никак связан с анимациями и развлечениями моя мини-игра привлекла большое количество ежедневных пользователей, а также вовлекла их в продукт. ' +
            'Менеджмент вместе с маркетологами уципились за этот неожиданный успех и в течение всего лета была активная маркетинговая компания по этой мини-игре, в которой учавствовали многие блогеры, а люди в своих телеграмм каналах обсуждали свою игру в это и думали какой-же приз будет дальше. ' +
            'Так я превратил мини анимацию в киллер фичу лета и миллионы вовлеченных пользователей.',
        results: [
            { label: 'DAU', value: '+53%' },
            { label: 'E-REACH', value: '+31%' },
            { label: 'Profit', value: '+32.5%' },
        ],
        tags: ['Анимации', 'Инициативность'],
        hideRightSlot: true,
    },
    {
        id: 'case-2',
        index: 13,
        title: 'Один против огромного проекта',
        company: 'Яндекс',
        period: '04.2025 - 05.2025',
        problem:
            'Из 3 фронтенд разработчиков 1 ушел делать проект для друой команды, а второй ушел в долгий отпуск.' +
            'Менеджеры принесли огромный проект, который нужно сделать в кратчайшие сроки.',
        solution:
            'Проект состоял в создании новой страницы с игровой механикой, призами и пр. ' +
            'Я решил впервые в нашем проекте использовать серверные компоненты и REST API (мы раньше использовали GraphQL и решли от него уйти). ' +
            'Кроме того интерактив решили делать на rive, а он никогда не использовался у нас на проекте и я впервые узнал о том, что это. ' +
            'По итогу я тогда еще работая на полставки засиживаясь до поздна разобрался в rive и прочем и к дедлайну сделал все необходимое в одиночку. ' +
            'Кроме того пример использования rive и как следствие мой универсальный компонент для него стал базой для всех будущих использований rive-а в нашей команде и по всему Яндекс Плюсу.',
        results: [
            { label: 'MAU', value: '+38%' },
            { label: 'E-REACH', value: '+15%' },
        ],
        tags: ['TypeScript', 'Rive', 'React', 'Nexr js', 'Server Components'],
        hideRightSlot: true,
    },
]
